#复变函数积分

柯西积分定理说明，单连通闭合区域上的全纯函数沿着任何可求长闭合曲线的积分是零。

这段代码计算复变函数的曲线的积分。

z = x + yi
* `path1()`:  积分路径 y=0 上 z = x + yi 的曲线的积分
* `path2()`:  积分路径 x=1 上 z = x + yi 的曲线的积分
* `path3()`:  积分路径 y=1 上 z = x + yi 的曲线的积分
* `path4()`:  积分路径 x=0 上 z = x + yi 的曲线的积分
* `path_integral_holomorphic()`: 计算闭合区域上的曲线的积分

f=1/(z-1)
* `path_integral()`: 计算闭合区域上的曲线的积分
* `path_integral_non_holomorphic()`: 打印结果

## 用法
```bash
poetry install
poetry run py complex-analysis.py
```

## 结果

以下是测试用例的预期输出结果及说明。

## 测试场景一：全纯函数
### 结果：
```python
积分路径 y=0: 1/2
积分路径 x=1: -1/2 + I
积分路径 y=1: -1/2 - I
积分路径 x=0: 1/2
和: 0
```
### 原因：
z = x + iy 是全纯函数。根据柯西定理，闭合区域上的曲线的积分是零。

## 测试场景二：不是全纯函数
### 结果：
```python
f=1/(z-1) 圆的曲线积分: 2*I*pi
```
### 原因：
f(z)=1/(z-1) 不是全纯函数。闭合区域上的曲线的积分是不零。


